#+TITLE: Kapitel 9: Objektorientierung, Vererbung  
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo


** Zunächst: Die Basisklasse ~Artikel~ 

Eine ganz normale Klasse: 

#+BEGIN_SRC python :exports both :results output
  class Artikel:
      def __init__(self, artikelnummer, preis):
          self.artikelnummer = artikelnummer
          self.preis = preis

      def markup(self, percentage):
          """Konvention: Percentage == 1 lässt Preis unverändert"""
          self.preis *= percentage

      def show_info(self):
          return "Artikel {} zu {}€".format(self.artikelnummer,
                                    self.preis)

      def __str__(self):
          return self.show_info()

  a = Artikel("1234", 42.17)
  print(a)
  a.markup(1.1)
  print(a)
#+END_SRC 

#+RESULTS:
: Artikel 1234 zu 42.17€
: Artikel 1234 zu 46.38700000000001€


** Unterklasse ~Werk~: Konstruktor der Oberklasse aufrufen 

Wie kommen wir an Konstruktor von ~Artikel~?
  - Zugriff über Namensraum der *Klasse*!
  - Mit ~self~ als explizitem Parameter! 
 
#+BEGIN_SRC python :exports code  :results output
  class Artikel:
      def __init__(self, artikelnummer, preis):
          self.artikelnummer = artikelnummer
          self.preis = preis

      def show_info(self):
          return "Artikel {} zu {}€".format(self.artikelnummer,
                                    self.preis)

  class Werk(Artikel):
      def __init__(self, artikelnummer, preis, ersteller, titel):
          # Oberklassen-Konstruktor aufrufen: 
          Artikel.__init__(self, artikelnummer, preis)
          self.ersteller = ersteller
          self.titel = titel

  # Ein Werk wird mit vier Parametern initiatlisert
  w = Werk("1234", 42.17, "Peter Müller", "Zur Bedeutung von GP1")
  print(w.show_info())
#+END_SRC 

#+RESULTS:
: Artikel 1234 zu 42.17€


** Unterklasse ~Werk~: Konstruktor der Oberklasse mit ~super~ aufrufen (2)   

#+BEGIN_SRC python :exports code  :results output
  %% tutor -t 
  class Artikel:
      def __init__(self, artikelnummer, preis):
          self.artikelnummer = artikelnummer
          self.preis = preis

      def show_info(self):
          return "Artikel {} zu {}€".format(self.artikelnummer,
                                    self.preis)

  class Werk(Artikel):
      def __init__(self, ersteller, titel, artikelnummer, preis):
          # Oberklassen-Konstruktor aufrufen: 
	  super().__init__(artikelnummer, preis)
          self.ersteller = ersteller
          self.titel = titel

  # Ein Werk wird mit vier Parametern initiatlisert
  w = Werk("Peter Müller", "Zur Bedeutung von GP1", "1234", 42.17)
  print(w.show_info())
#+END_SRC 

#+RESULTS:
: Artikel 1234 zu 42.17€

** Unterklasse ~Werk~: Parameter des Oberklasse-Konstruktors durchreichen 

#+BEGIN_SRC python :exports code  :results output
  class Artikel:
      def __init__(self, artikelnummer, preis):
          self.artikelnummer = artikelnummer
          self.preis = preis

      def show_info(self):
          return "Artikel {} zu {}€".format(self.artikelnummer,
                                    self.preis)

  class Werk(Artikel):
      def __init__(self, ersteller, titel, *args, **kwargs):
          # Oberklassen-Konstruktor aufrufen: 
          super().__init__(*args, **kwargs)
          self.ersteller = ersteller
          self.titel = titel

  # Ein Werk wird mit vier Parametern initialisert
  w = Werk("Peter Müller", "Zur Bedeutung von GP1", "1234", 42.17, )
  print(w.show_info())
#+END_SRC 

#+RESULTS:
: Artikel 1234 zu 42.17€

** Unterklasse ~Werk~: Parameter des Oberklasse-Konstruktors durchreichen (2) 

Oder noch schöner beim Instantiieren: Mit keyword-Argumenten 
- Dann ist Reihenfolge egal! 

#+BEGIN_SRC python :exports code  :results output
  class Artikel:
      def __init__(self, artikelnummer, preis):
          self.artikelnummer = artikelnummer
          self.preis = preis

      def show_info(self):
          return "Artikel {} zu {}€".format(self.artikelnummer,
                                    self.preis)

  class Werk(Artikel):
      def __init__(self, ersteller, titel, *args, **kwargs):
          # Oberklassen-Konstruktor aufrufen: 
          super().__init__(*args, **kwargs)
          self.ersteller = ersteller
          self.titel = titel

  # Ein Werk wird mit vier Parametern initialisert
  w = Werk(artikelnummer="1234", preis=42.17,
           ersteller="Peter Mueller", titel="Zur Bedeutung von GP1",)
  print(w.show_info())
#+END_SRC 

#+RESULTS:
: Artikel 1234 zu 42.17€

** Unterklasse ~Werk~: ~show_info~


- Objekt wird jetzt wohl richtig initialisiert
- Aber nicht richtig ausgegeben
- Wir müssen die Methode ~show_info~ noch überschreiben! 


#+BEGIN_SRC python :exports code  :results output
  class Artikel:
      def __init__(self, artikelnummer, preis):
          self.artikelnummer = artikelnummer
          self.preis = preis

      def show_info(self):
          return "Artikel {} zu {}€".format(self.artikelnummer,
                                    self.preis)

  class Werk(Artikel):
      def __init__(self, ersteller, titel, *args, **kwargs):
          # Oberklassen-Konstruktor aufrufen: 
          super().__init__(*args, **kwargs)
          self.ersteller = ersteller
          self.titel = titel

      def show_info(self):
          return "'{}' von {} (Artikel {} zu {} €)".format(
              self.titel,
              self.ersteller,
              self.artikelnummer,
              self.preis)

  # Ein Werk wird mit vier Parametern initialisert
  w = Werk(artikelnummer="1234", preis=42.17,
           ersteller="Peter Mueller", titel="Zur Bedeutung von GP1",)
  print(w.show_info())
#+END_SRC 

#+RESULTS:
: 'Zur Bedeutung von GP1' von Peter Mueller (Artikel 1234 zu 42.17€)


** Unterklasse ~Werk~: ~show_info~ -- Oberklasse mitbenutzen 

- Oder in ~Werk.show_info~ Methode ~Artikel.show_info~ nutzen
  - *Don't repeat yourself!*

#+BEGIN_SRC python :exports code  :results output
  class Artikel:
      def __init__(self, artikelnummer, preis):
          self.artikelnummer = artikelnummer
          self.preis = preis

      def show_info(self):
          return "Artikel {} zu {}€".format(self.artikelnummer,
                                    self.preis)

  class Werk(Artikel):
      def __init__(self, ersteller, titel, *args, **kwargs):
          # Oberklassen-Konstruktor aufrufen: 
          super().__init__(*args, **kwargs)
          self.ersteller = ersteller
          self.titel = titel

      def show_info(self):
          return "'{}' von {} ({})".format(
              self.titel,
              self.ersteller,
	      super().show_info())

  # Ein Werk wird mit vier Parametern initialisert
  w = Werk(artikelnummer="1234", preis=42.17,
           ersteller="Peter Mueller", titel="Zur Bedeutung von GP1",)
  print(w.show_info())
#+END_SRC 

#+RESULTS:
: 'Zur Bedeutung von GP1' von Peter Mueller (Artikel 1234 zu 42.17€)


** str mitbenutzen? 

Was wird hier ausgeben? Warum? 

#+BEGIN_SRC python :exports code  :results output
%%tutor -t
class Artikel:
    def __init__(self, artikelnummer, preis):
        self.artikelnummer = artikelnummer
        self.preis = preis

    def show_info(self):
        return "Artikel {} zu {}€".format(self.artikelnummer,
                                  self.preis)

    def __str__(self):
        return self.show_info()

class Werk(Artikel):
    def __init__(self, ersteller, titel, *args, **kwargs):
        # Oberklassen-Konstruktor aufrufen: 
        super().__init__(*args, **kwargs)
        self.ersteller = ersteller
        self.titel = titel

    def show_info(self):
        return "'{}' von {} ({})".format(
            self.titel,
            self.ersteller,
            super().show_info())

# Ein Werk wird mit vier Parametern initialisert
w = Werk(artikelnummer="1234", preis=42.17,
         ersteller="Peter Mueller", titel="Zur Bedeutung von GP1",)
print(w)
#+END_SRC 

#+RESULTS:
: 'Zur Bedeutung von GP1' von Peter Mueller (Artikel 1234 zu 42.17€)

** Beispiel: Dynamische Bindung in Klassenhierarchie 

#+BEGIN_SRC python :exports both :results output
  class A:
      def __str__(self):
          return "A"

  class B(A):
      pass

  class B1(B):
      def __str__(self):
          return "B1"

  class B2(B):
      pass

  class C(A):
      def __str__(self):
          return "C"
  
  class C1(C):
      def __str__(self):
          return "C1"

  class C2(C):
      pass

  class C3(C):
      def __str__(self):
          return super().__str__()

  for l in [A(), B(), B1(), B2(), C(), C1(), C2(), C3()]:
      print(l, end=", ")
#+END_SRC 

#+RESULTS:
: A, A, B1, A, C, C1, C, C, 



** Veranschaulichung: ~isinstance~ und ~__class__~, ~__name__~ -- Beispiel 


#+BEGIN_SRC python :exports both :results output
  class A: pass

  class B(A): pass 

  class B1(B): pass

  class B2(B): pass

  class C(A): pass

  class C1(C): pass 

  class C2(C): pass 

  class C3(C): pass 

  for l in [A(), B(), B1(), B2(), C(), C1(), C2(), C3()]:
      print("{} von Klasse {}: ".format(l,
                                        l.__class__.__name__),
                                        end="")
      print("is-a A: {}; ". format(isinstance(l, A)), end="") 
      print("is-a B: {}; ". format(isinstance(l, B)), end="") 
      print("is-a C: {}". format(isinstance(l, C))) 
#+END_SRC 

#+RESULTS:
: <__main__.A object at 0x101135b70> von Klasse A: is-a A: True; is-a B: False; is-a C: False
: <__main__.B object at 0x101135ba8> von Klasse B: is-a A: True; is-a B: True; is-a C: False
: <__main__.B1 object at 0x101135be0> von Klasse B1: is-a A: True; is-a B: True; is-a C: False
: <__main__.B2 object at 0x101135c18> von Klasse B2: is-a A: True; is-a B: True; is-a C: False
: <__main__.C object at 0x101135c50> von Klasse C: is-a A: True; is-a B: False; is-a C: True
: <__main__.C1 object at 0x101135c88> von Klasse C1: is-a A: True; is-a B: False; is-a C: True
: <__main__.C2 object at 0x101135cc0> von Klasse C2: is-a A: True; is-a B: False; is-a C: True
: <__main__.C3 object at 0x101135cf8> von Klasse C3: is-a A: True; is-a B: False; is-a C: True


** Veranschaulichung: ~isinstance~ und ~__class__~, ~__name__~ -- Beispiel mit ~__str__~ 

Mit einer ~__str()__~-Methode in ~A~: 

#+BEGIN_SRC python :exports both :results output
  class A:
      def __str__(self):
          return "ich bin ein Objekt der Klasse {}; ".format(self.__class__.__name__)

  class B(A): pass 

  class B1(B): pass

  class B2(B): pass

  class C(A): pass

  class C1(C): pass 

  class C2(C): pass 

  class C3(C): pass 

  for l in [A(), B(), B1(), B2(), C(), C1(), C2(), C3()]:
      print(l, end="")
      print("is-a A: {}; ". format(isinstance(l, A)), end="") 
      print("is-a B: {}; ". format(isinstance(l, B)), end="") 
      print("is-a C: {}". format(isinstance(l, C))) 
#+END_SRC 

#+RESULTS:
: ich bin ein Objekt der Klasse A; is-a A: True; is-a B: False; is-a C: False
: ich bin ein Objekt der Klasse B; is-a A: True; is-a B: True; is-a C: False
: ich bin ein Objekt der Klasse B1; is-a A: True; is-a B: True; is-a C: False
: ich bin ein Objekt der Klasse B2; is-a A: True; is-a B: True; is-a C: False
: ich bin ein Objekt der Klasse C; is-a A: True; is-a B: False; is-a C: True
: ich bin ein Objekt der Klasse C1; is-a A: True; is-a B: False; is-a C: True
: ich bin ein Objekt der Klasse C2; is-a A: True; is-a B: False; is-a C: True
: ich bin ein Objekt der Klasse C3; is-a A: True; is-a B: False; is-a C: True



** ~dir~ einer Klasse, eines Objektes 

- Eingebaute Funktion: ~dir~
- Anwendbar auf Klassen, Objekte
- Gibt die bekannten Attribute als Liste zurück 

#+BEGIN_SRC python :exports both :results output
  print("Verzeichnis der Klasse object:")
  print(dir(object))

  class C:
      def bla(): pass

  c = C()
  # Verzeichnis eins Objekts der Klasse C
  print(dir(c))
  # Gibt es eine Methode hallo in Klasse C? 
  print("hallo" in dir(C))
#+END_SRC 

#+RESULTS:
: Verzeichnis der Klasse object:
: ['__class__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__le__', '__lt__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__']
: ['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', 'bla']
: False

** Attribute inspizieren: ~getattr~

Was wissen wir über ~bla~? 
- Eingebaute Funktion ~getattr~ liefert Information über Attribute
  einer Klasse, eines Objektes 

#+BEGIN_SRC python :exports both :results output
  class C:
      def bla(): pass

  c = C()
  print(getattr(C, 'bla'))
  print(getattr(c, 'bla'))
#+END_SRC 

#+RESULTS:
: <function C.bla at 0x10107b6a8>
: <bound method C.bla of <__main__.C object at 0x101035898>>

** /getter/ und /setter/ -- Beispiel Temperatur 

Temperatur-Beispiel folgt grob  [[http://www.programiz.com/python-programming/property][dieser Webseite]]. 

#+BEGIN_SRC python :exports both :results output
  class Temperature:
      def __init__(self, temp=0):
          # rufe setter auch uns Methode der Klasse auf: 
          self.set_temperature(temp)

      def get_temperature(self):
          return self._temperature

      def set_temperature(self, value):
          if value < 0:
              return "Error"
          else:
              self._temperature = value

  t1 = Temperature(17)
  print(t1.get_temperature())
  t1.set_temperature(4242)
  print(t1.get_temperature())
  t1.set_temperature(-99)
  print(t1.get_temperature())
#+END_SRC 

#+RESULTS:
: 17
: 4242
: 4242

** /getter/ und /setter/ -- Beispiel Temperatur: Scheinattribute hinzufügen  


- Grad Celsius zusätzlich zu Kelvin?
- Getter und setter für Celsius
  - Aber wir nutzen nur /ein/ Temperatur-Attribut! 

#+BEGIN_SRC python :exports both :results output
  class Temperature:
      def __init__(self, temp=0):
          # rufe setter auch uns Methode der Klasse auf: 
          self.set_temperature(temp)

      def get_temperature(self):
          return self._temperature

      def set_temperature(self, value):
          if value < 0:
              return "Error"
          else:
              self._temperature = value

      # Ein weiteres getter/setter-Paar:
      def get_celsius(self):
          return self.get_temperature() - 273

      def set_celsius(self, value):
          return self.set_temperature(value + 273)
          
  t1 = Temperature(17)
  print(t1.get_temperature())
  t1.set_celsius(100)
  print("In Kelvin:",  t1.get_temperature())
  print("In Celsius:", t1.get_celsius())
#+END_SRC 

#+RESULTS:
: 17
: In Kelvin: 373
: In Celsius: 100

** Getter und Setter: /Property/ -- Beispiel Temperature 

#+BEGIN_SRC python :exports both :results output
  class Temperature:
      def __init__(self, temp=0):
          # auch Methoden der Klasse greifen normal auf das Attribut zu: 
          self._temperature = temp

      def get_temperature(self):
          print("Lesender Zugriff")
          return self._temperature

      def set_temperature(self, value):
          print("Schreibender Zugriff")
          if value < 0:
              return "Error"
          else:
              self._temperature = value

      # Vereinbare Attribut temperature als eine Property:
      temperature = property(get_temperature,
                             set_temperature)

  t1 = Temperature(17)
  print(t1.temperature) 
  t1.temperature = 42
  print(t1.temperature) 
#+END_SRC 

#+RESULTS:
: Schreibender Zugriff
: Lesender Zugriff
: 17
: Schreibender Zugriff
: Lesender Zugriff
: 42

** Weitere getter/setter: Celsius 

#+BEGIN_SRC python :exports both :results output
  class Temperature:
      def __init__(self, temp=0):
          # auch Methoden der Klasse greifen normal auf das Attribut zu: 
          self._temperature = temp

      def get_temperature(self):
          print("Lesender Zugriff")
          return self._temperature

      def set_temperature(self, value):
          print("Schreibender Zugriff")
          if value < 0:
              return "Error"
          else:
              self._temperature = value

      # Vereinbare Attribut temperature als eine Property:
      temperature = property(get_temperature,
                             set_temperature)

      # Eine zweite Property:
      def get_celsius(self):
          return self._temperature - 273

      def set_celsius(self, val):
          self._temperature = val + 273
        
      celsius = property(get_celsius, set_celsius) 

  t1 = Temperature(273)
  print(t1.celsius) 
#+END_SRC 

#+RESULTS:
: Lesender Zugriff
: 0


